In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(data={'Col1':np.random.randint(low=0,high=50,size=10),
                        'Col2':np.random.randn(10),
                        'Col3':['A','B','C','A','A','C','D','B','A','A'],
                        'Col4':np.random.choice([True, False],size=10),
                        'Col5':np.random.randint(low=1,high=4,size=10)},
                  index=pd.date_range(start='01/01/2021', periods=10, freq='M'))
df

            Col1      Col2 Col3   Col4  Col5
2021-01-31    15 -0.484742    A  False     3
2021-02-28    38  0.646052    B   True     3
2021-03-31    47  1.352063    C  False     2
2021-04-30     6 -0.058856    A   True     3
2021-05-31    49  0.688803    A  False     1
2021-06-30    13  1.270020    C   True     2
2021-07-31    36 -1.171708    D   True     2
2021-08-31    19  0.867026    B  False     3
2021-09-30    38 -1.418720    A   True     2
2021-10-31    48  0.985989    A   True     2

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 2021-01-31 to 2021-10-31
Freq: M
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col1    10 non-null     int64
 1   Col2    10 non-null     float64
 2   Col3    10 non-null     object
 3   Col4    10 non-null     bool
 4   Col5    10 non-null     int64
dtypes: bool(1), float64(1), int64(2), object(1)
memory usage: 410.0+ bytes

In [4]:
df_practice = pd.read_csv("https://raw.githubusercontent.com/Code-Institute-Solutions/sample-datasets/main/penguins.csv")
df_practice

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [5]:
df_practice.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   bill_length_mm     342 non-null    float64
 3   bill_depth_mm      342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                333 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [6]:
df.head()

            Col1      Col2 Col3   Col4  Col5
2021-01-31    15 -0.484742    A  False     3
2021-02-28    38  0.646052    B   True     3
2021-03-31    47  1.352063    C  False     2
2021-04-30     6 -0.058856    A   True     3
2021-05-31    49  0.688803    A  False     1

In [7]:
df.head(n=3)

            Col1      Col2 Col3   Col4  Col5
2021-01-31    15 -0.484742    A  False     3
2021-02-28    38  0.646052    B   True     3
2021-03-31    47  1.352063    C  False     2

In [8]:
df.tail()

            Col1      Col2 Col3   Col4  Col5
2021-06-30    13  1.270020    C   True     2
2021-07-31    36 -1.171708    D   True     2
2021-08-31    19  0.867026    B  False     3
2021-09-30    38 -1.418720    A   True     2
2021-10-31    48  0.985989    A   True     2

In [9]:
df.shape

(10, 5)

In [10]:
df.dtypes

Col1      int64
Col2    float64
Col3     object
Col4       bool
Col5      int64
dtype: object

In [11]:
df.columns

Index(['Col1', 'Col2', 'Col3', 'Col4', 'Col5'], dtype='object')

In [12]:
type(df.columns)

pandas.core.indexes.base.Index

In [13]:
df.columns.to_list()

['Col1', 'Col2', 'Col3', 'Col4', 'Col5']

In [14]:
list(df.columns)

['Col1', 'Col2', 'Col3', 'Col4', 'Col5']

In [15]:
df['Col3'].unique()

array(['A', 'B', 'C', 'D'], dtype=object)

In [16]:
df_practice['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [17]:
df['Col3'].nunique()

4

In [18]:
df_practice['species'].nunique()

3

In [19]:
df['Col3'].value_counts()

A    5
B    2
C    2
D    1
Name: Col3, dtype: int64

In [20]:
df['Col3'].value_counts(normalize=True)

A    0.5
B    0.2
C    0.2
D    0.1
Name: Col3, dtype: float64

In [21]:
df_practice['island'].value_counts()

Biscoe       168
Dream        124
Torgersen     52
Name: island, dtype: int64

In [22]:
df_practice['island'].value_counts(normalize=True)

Biscoe       0.488372
Dream        0.360465
Torgersen    0.151163
Name: island, dtype: float64

In [23]:
 pd.DataFrame(data={'Count':df_practice['island'].value_counts(), 'Relative':df_practice['island'].value_counts(normalize=True)})

           Count  Relative
Biscoe       168  0.488372
Dream        124  0.360465
Torgersen     52  0.151163

In [24]:
df.describe(include='all')

             Col1       Col2 Col3  Col4       Col5
count   10.000000  10.000000   10    10  10.000000
unique        NaN        NaN    4     2        NaN
top           NaN        NaN    A  True        NaN
freq          NaN        NaN    5     6        NaN
mean    30.900000   0.267593  NaN   NaN   2.300000
std     16.127616   0.998043  NaN   NaN   0.674949
min      6.000000  -1.418720  NaN   NaN   1.000000
25%     16.000000  -0.378271  NaN   NaN   2.000000
50%     37.000000   0.667428  NaN   NaN   2.000000
75%     44.750000   0.956249  NaN   NaN   3.000000
max     49.000000   1.352063  NaN   NaN   3.000000

In [25]:
df_practice.describe(include='all')

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
count,344,344,342.000000,342.000000,342.000000,342.000000,333
unique,3,3,NaN,NaN,NaN,NaN,2
top,Adelie,Biscoe,NaN,NaN,NaN,NaN,MALE
freq,152,168,NaN,NaN,NaN,NaN,168
mean,NaN,NaN,43.921930,17.151170,200.915205,4201.754386,NaN
std,NaN,NaN,5.459584,1.974793,14.061714,801.954536,NaN
min,NaN,NaN,32.100000,13.100000,172.000000,2700.000000,NaN
25%,NaN,NaN,39.225000,15.600000,190.000000,3550.000000,NaN
50%,NaN,NaN,44.450000,17.300000,197.000000,4050.000000,NaN
75%,NaN,NaN,48.500000,18.700000,213.000000,4750.000000,NaN
max,NaN,NaN,59.600000,21.500000,231.000000,6300.000000,NaN

In [26]:
df.corr()  # or df.corr(method='pearson')

          Col1      Col2      Col4      Col5
Col1  1.000000  0.108765 -0.085385 -0.650214
Col2  0.108765  1.000000 -0.291642 -0.086118
Col4 -0.085385 -0.291642  1.000000  0.063758
Col5 -0.650214 -0.086118  0.063758  1.000000

In [27]:
df.corr(method='spearman')

          Col1      Col2      Col4      Col5
Col1  1.000000  0.212767 -0.213850 -0.635101
Col2  0.212767  1.000000 -0.284268 -0.201008
Col4 -0.213850 -0.284268  1.000000  0.000000
Col5 -0.635101 -0.201008  0.000000  1.000000